In [1]:
def hello():
    print("hello corona")
    
hello()#calling the function hello

hello corona

In [2]:
def add(a,b):
    return a+b


x=add(20,30)
print(x)

50

In [3]:
def hello(name):
    print("hello "+name)
    
    
hello("nabanita")

hello nabanita

In [4]:
def hello(fname,lname):
    print(fname+" "+lname)
    
hello("sumanta","maji")

sumanta maji

In [5]:
def my_sum(*a):
    result=0
    for x in a:
        result = result + x
    return result
    
    
my_sum(1,2,3,4,5,6)

21

In [12]:
def fun(a,*b):#  *args
    print(a)
    for x in b:
        print(x)
    
    
fun(4,3,6,2,9,7)

4
3
6
2
9
7

In [2]:
def fun1(*args):
    for i in args:
        print(i)

        
fun1("sumanta","nabanita","joy","bijoy")

sumanta
nabanita
joy
bijoy

In [1]:
#**kwargs
def fun1(**kwargs):
    for i,j in kwargs.items():
        print(i,end=" : ")
        print(j)

        
fun1(name="sumanta",add="piyala")

name : sumanta
add : piyala

In [12]:
class Myclass:
    def __init__(self,name,age):
        self.n=name
        self.a=age
    
    def foo(self):
        return "hello ! my name is {} and my age is {}".format(self.n,self.a)
    
    
x=Myclass("nabanita",21)

print(x.foo())

hello ! my name is nabanita and my age is 21

In [17]:
# class and instance variable

class dog:
    name="german shepherd"#class variable shared by all objects or instance
    
    def __init__(self,name):
        self.dog_name=name
        

        
d=dog("labrado")
b=dog("pug")
c=dog("bulldog")
e=dog("pit bull")

print(d.name,end=" ")
print(d.dog_name)

print(b.name,end=" ")
print(b.dog_name)
print(c.name,end=" ")
print(e.dog_name)
print(e.name,end=" ")
print(c.dog_name)

german shepherd labrado
german shepherd pug
german shepherd pit bull
german shepherd bulldog

In [6]:
class shopping:
    # this list is commonly share with every object
    
    def __init__(self,name):
        self.name=name
        self.product=[]
        
    def add_items(self,item):
        self.product.append(item)
    def show(self):
        return "{} has bought {}".format(self.name,self.product)
        
a=shopping("nabanita")
a.add_items("lipstic")
a.add_items("vegitable")
a.add_items("jewlery") 
a.add_items("medicine")            
print(a.show())
            
            
            
            
b=shopping("sanchita")
b.add_items("baby food")
b.add_items("baby lotion")
b.add_items("baby medicine")
print(b.show())

nabanita has bought ['lipstic', 'vegitable', 'jewlery', 'medicine']
sanchita has bought ['baby food', 'baby lotion', 'baby medicine']

In [11]:
class Person:

    def __init__(self, first, last):
        self.firstn = first
        self.lastn = last

    def Name(self):
        return self.firstn + " " + self.lastn

class Emp(Person):

    def __init__(self, first, last, staffnum):
        Person.__init__(self,first, last)
        self.staffno = staffnum

    def GetEmp(self):
        return self.Name() + ", " +  self.staffno


b = Emp("Alex", "Karlos", "A102")

print(b.Name())
print(b.GetEmp())

Alex Karlos
Alex Karlos, A102

In [25]:
import pandas as pd 
nabanita=pd.read_csv("D:\\titanic_train.csv",usecols=["PassengerId","Name","Ticket","Sex"])

nabanita["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [1]:
import pandas as pd 
df=pd.read_csv("D:\\titanic_train.csv")

In [2]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [13]:
df.groupby("Embarked").mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Embarked,,,,,,,
C,445.357143,0.553571,1.886905,30.814769,0.386905,0.363095,59.954144
Q,417.896104,0.389610,2.909091,28.089286,0.428571,0.168831,13.276030
S,449.527950,0.336957,2.350932,29.445397,0.571429,0.413043,27.079812